Sketch contains more than one chain. Can't create Path Reinforcement.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PathReinforcementManyLoops { get; }
  Visual Basic
Public Shared ReadOnly Property PathReinforcementManyLoops As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PathReinforcementManyLoops {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace